---
kind: type
id: T:Autodesk.Revit.DB.FormatValueOptions
source: html/8d063304-e035-572f-6460-ffe1e453eb14.htm
---
# Autodesk.Revit.DB.FormatValueOptions

Options for formatting numbers with units into strings.

## Syntax (C#)
```csharp
public class FormatValueOptions : IDisposable
```